{
    "test@gmail.com": {
        "id": "004e3878-55b7-11ee-8742-d8bbc1d8446c",
        "email": "test@gmail.com",
        "display_name": "krit",
        "age": 34,
        "password": "1234",
        "exercise_plans": [],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIwMDRlMzg3OC01NWI3LTExZWUtODc0Mi1kOGJiYzFkODQ0NmMifQ.uZL2WvraBC7LU4k2A4lRytggCJCyVfnt281UTeGN7Zc"
    },
    "test2@gmail.com": {
        "id": "85b3e94b-5d1c-11ee-87b5-ecb1d7406c9d",
        "email": "test2@gmail.com",
        "display_name": "testboi",
        "age": 19,
        "password": "1234",
        "exercise_plans": [],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI4NWIzZTk0Yi01ZDFjLTExZWUtODdiNS1lY2IxZDc0MDZjOWQifQ.1nU3qLPmIDwqN3OwDGdDwapkUu7Qv9MJTTkN5DEps8I"
    },
    "test3@gmail.com": {
        "id": "<class 'uuid.UUID'>",
        "email": "test3@gmail.com",
        "password": "1234",
        "display_name": "hello",
        "age": 34,
        "exercise_plans": [
            {
                "exercise_name": "Incline Hammer Curls",
                "exercise_type": "strength",
                "exercise_difficulty": "beginner",
                "exercise_equipment": "dumbbell",
                "exercise_instruction": "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position. Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary. Continue to the top of the movement and pause, then slowly return to the start position."
            },
            {
                "exercise_name": "EZ-bar spider curl",
                "exercise_type": "strength",
                "exercise_difficulty": "intermediate",
                "exercise_equipment": "barbell",
                "exercise_instruction": "Start out by setting the bar on the part of the preacher bench that you would normally sit on. Make sure to align the barbell properly so that it is balanced and will not fall off. Move to the front side of the preacher bench (the part where the arms usually lay) and position yourself to lay at a 45 degree slant with your torso and stomach pressed against the front side of the preacher bench. Make sure that your feet (especially the toes) are well positioned on the floor and place your upper arms on top of the pad located on the inside part of the preacher bench. Use your arms to grab the barbell with a supinated grip (palms facing up) at about shoulder width apart or slightly closer from each other. Slowly begin to lift the barbell upwards and exhale. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the barbell back to the starting position as your breathe in. . Repeat for the recommended amount of repetitions.  Variation: You can also use dumbbells when performing this exercise. Just make sure you place the dumbbells on the part of the preacher bench where you would normally sit properly."
            },
            {
                "exercise_name": "Dumbbell Bench Press",
                "exercise_type": "strength",
                "exercise_difficulty": "intermediate",
                "exercise_equipment": "dumbbell",
                "exercise_instruction": "Lie down on a flat bench with a dumbbell in each hand resting on top of your thighs. The palms of your hands will be facing each other. Then, using your thighs to help raise the dumbbells up, lift the dumbbells one at a time so that you can hold them in front of you at shoulder width. Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. The dumbbells should be just to the sides of your chest, with your upper arm and forearm creating a 90 degree angle. Be sure to maintain full control of the dumbbells at all times. This will be your starting position. Then, as you breathe out, use your chest to push the dumbbells up. Lock your arms at the top of the lift and squeeze your chest, hold for a second and then begin coming down slowly. Tip: Ideally, lowering the weight should take about twice as long as raising it. Repeat the movement for the prescribed amount of repetitions of your training program.  Caution: When you are done, do not drop the dumbbells next to you as this is dangerous to your rotator cuff in your shoulders and others working out around you. Just lift your legs from the floor bending at the knees, twist your wrists so that the palms of your hands are facing each other and place the dumbbells on top of your thighs. When both dumbbells are touching your thighs simultaneously push your upper torso up (while pressing the dumbbells on your thighs) and also perform a slight kick forward with your legs (keeping the dumbbells on top of the thighs). By doing this combined movement, momentum will help you get back to a sitting position with both dumbbells still on top of your thighs. At this moment you can place the dumbbells on the floor. Variations: Another variation of this exercise is to perform it with the palms of the hands facing each other. Also, you can perform the exercise with the palms facing each other and then twisting the wrist as you lift the dumbbells so that at the top of the movement the palms are facing away from the body. I personally do not use this variation very often as it seems to be hard on my shoulders."
            },
            {
                "exercise_name": "Pushups",
                "exercise_type": "strength",
                "exercise_difficulty": "intermediate",
                "exercise_equipment": "body_only",
                "exercise_instruction": "Lie on the floor face down and place your hands about 36 inches apart while holding your torso up at arms length. Next, lower yourself downward until your chest almost touches the floor as you inhale. Now breathe out and press your upper body back up to the starting position while squeezing your chest. After a brief pause at the top contracted position, you can begin to lower yourself downward again for as many repetitions as needed.  Variations: If you are new at this exercise and do not have the strength to perform it, you can either bend your legs at the knees to take off resistance or perform the exercise against the wall instead of the floor. For the most advanced lifters, you can place your feet at a high surface such as a bench in order to increase the resistance and to target the upper chest more."
            }
        ],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI8Y2xhc3MgJ3V1aWQuVVVJRCc-In0.6YQm0_2mAF77j9pWe0v4LKb2TntEcGABgdfggULqRDY"
    },
    "test4@gmail.com": {
        "id": "72745063-7f04-11ee-b90a-f8ac65b53c76",
        "email": "test4@gmail.com",
        "password": "1234",
        "display_name": "test4",
        "age": 45,
        "exercise_plans": [],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI3Mjc0NTA2My03ZjA0LTExZWUtYjkwYS1mOGFjNjViNTNjNzYifQ.RSHkfvDV6Z_3glXs4sJiBGkR1kT4VrZ6uoVKa7hoecI"
    },
    "fuck@gmail.com": {
        "id": "d5c92160-7fb2-11ee-b2af-00a5541ff9ef",
        "email": "fuck@gmail.com",
        "password": "1234",
        "display_name": "fuck",
        "age": 34,
        "exercise_plans": [],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJkNWM5MjE2MC03ZmIyLTExZWUtYjJhZi0wMGE1NTQxZmY5ZWYifQ.fALAqKmMg_9jwdG6gKZ6JM4Hndg1UzmTYlJ3pU3WEVM"
    },
    "new@uxb.ac.uk": {
        "id": "011606ef-7fb5-11ee-86e5-00a5541ff9ef",
        "email": "new@uxb.ac.uk",
        "password": "1234",
        "display_name": "new",
        "age": 54,
        "exercise_plans": [],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIwMTE2MDZlZi03ZmI1LTExZWUtODZlNS0wMGE1NTQxZmY5ZWYifQ.tC6USpQeF-lGlVMYK5Ex-pAG_dp7mDnqysmC5hTRmhE"
    },
    "test5@gmail.com": {
        "id": "bebaf56c-7fc4-11ee-950a-f4c88af00667",
        "email": "test5@gmail.com",
        "password": "1234",
        "display_name": "tello",
        "age": 34,
        "exercise_plans": [],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJiZWJhZjU2Yy03ZmM0LTExZWUtOTUwYS1mNGM4OGFmMDA2NjcifQ._3mU11kFrj0e4u9M6u3u4KNzn9dBl3rEEOparh4hrXQ"
    },
    "mysmyo@lovemail.com": {
        "id": "97b52fe2-817b-11ee-a106-10a51d91d394",
        "email": "mysmyo@lovemail.com",
        "password": "1234",
        "display_name": "mysler",
        "age": 24,
        "exercise_plans": [
            {
                "exercise_name": "Palms-down wrist curl over bench",
                "exercise_type": "strength",
                "exercise_difficulty": "intermediate",
                "exercise_equipment": "barbell",
                "exercise_instruction": "Start out by placing a barbell on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab the barbell with a pronated grip (palms down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a dumbbell instead of a barbell."
            }
        ],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI5N2I1MmZlMi04MTdiLTExZWUtYTEwNi0xMGE1MWQ5MWQzOTQifQ.oOfBTr6m3iLJTCxOeyvIiv6bV_13rWJAXB3y5ygunWQ"
    },
    "mack@goa.co.uk": {
        "id": "f70d9d72-81ab-11ee-86b4-10a51d91d394",
        "email": "mack@goa.co.uk",
        "password": "1234",
        "display_name": "mack",
        "age": 23,
        "exercise_plans": [
            {
                "exercise_name": "Rickshaw Carry",
                "exercise_type": "strongman",
                "exercise_difficulty": "beginner",
                "exercise_equipment": "other",
                "exercise_instruction": "Position the frame at the starting point, and load with the appropriate weight. Standing in the center of the frame, begin by gripping the handles and driving through your heels to lift the frame. Ensure your chest and head are up and your back is straight. Immediately begin walking briskly with quick, controlled steps. Keep your chest up and head forward, and make sure you continue breathing. Bring the frame to the ground after you have reached the end point."
            },
            {
                "exercise_name": "Palms-down wrist curl over bench",
                "exercise_type": "strength",
                "exercise_difficulty": "intermediate",
                "exercise_equipment": "barbell",
                "exercise_instruction": "Start out by placing a barbell on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab the barbell with a pronated grip (palms down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a dumbbell instead of a barbell."
            }
        ],
        "diet_plans": [],
        "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJmNzBkOWQ3Mi04MWFiLTExZWUtODZiNC0xMGE1MWQ5MWQzOTQifQ.P0Eg5tfwvFf5In-oH_HsZgG6sGED_44rg4lUVyTFIpk"
    }
}